RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_ll_rcc.c
    case LL_RCC_ADCDAC_CLKSOURCE_MSIK:          /* MSIK clock used as ADCDAC clock source */
      if (LL_RCC_MSIK_IsReady() == 1U)
      {
        adcdac_frequency = __LL_RCC_CALC_MSIK_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                                   ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                                    LL_RCC_MSIK_GetRange() :
                                                    LL_RCC_MSIK_GetRangeAfterStandby()));
      }
      break;

    default:
      /* unreachable code */
      break;
  }

  return adcdac_frequency;
}

/**
  * @brief  Return ADF1 clock frequency
  * @param  ADF1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE
  * @retval ADF1 clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (MSIK) or PLL is not ready
  */
uint32_t LL_RCC_GetADF1ClockFreq(uint32_t ADF1Source)
{
  uint32_t ADF1_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_ADF1_CLKSOURCE(ADF1Source));

  /* ADF11CLK clock frequency */
  switch (LL_RCC_GetADF1ClockSource(ADF1Source))
  {
    case LL_RCC_ADF1_CLKSOURCE_HCLK:        /* ADF1 Clock is SYSCLK */
      ADF1_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_ADF1_CLKSOURCE_PLL1:       /* ADF1 Clock is PLL1 */
      ADF1_frequency = RCC_PLL1_GetFreqDomain_SAI();
      break;

    case LL_RCC_ADF1_CLKSOURCE_PLL3:       /* ADF1 Clock is PLL3 */
      ADF1_frequency = RCC_PLL3_GetFreqDomain_48M();
      break;

    case LL_RCC_ADF1_CLKSOURCE_PIN:        /* External input clock used as ADF1 clock source */
      ADF1_frequency = EXTERNAL_SAI1_CLOCK_VALUE;
      break;

    case LL_RCC_ADF1_CLKSOURCE_MSIK:        /* ADF1 Clock is MSIK */
      ADF1_frequency = __LL_RCC_CALC_MSIK_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                               ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                                LL_RCC_MSIK_GetRange() :
                                                LL_RCC_MSIK_GetRangeAfterStandby()));
      break;

    default:
      /* unreachable code */
      break;
  }

  return ADF1_frequency;
}

/**
  * @brief  Return MDF1 clock frequency
  * @param  MDF1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE
  * @retval MDF1 clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (MSIK) or PLL is not ready
  */
uint32_t LL_RCC_GetMDF1ClockFreq(uint32_t MDF1Source)
{
  uint32_t MDF1_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_MDF1_CLKSOURCE(MDF1Source));

  /* MDF11CLK clock frequency */
  switch (LL_RCC_GetMDF1ClockSource(MDF1Source))
  {
    case LL_RCC_MDF1_CLKSOURCE_HCLK:        /* MDF1 Clock is SYSCLK */
      MDF1_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_MDF1_CLKSOURCE_PLL1:        /* MDF1 Clock is PLL1 */
      MDF1_frequency = RCC_PLL1_GetFreqDomain_SAI();
      break;

    case LL_RCC_MDF1_CLKSOURCE_PLL3:        /* MDF1 Clock is PLL3 */
      MDF1_frequency = RCC_PLL3_GetFreqDomain_48M();
      break;

    case LL_RCC_MDF1_CLKSOURCE_PIN:         /* External input clock used as MDF1 clock source */
      MDF1_frequency = EXTERNAL_SAI1_CLOCK_VALUE;
      break;

    case LL_RCC_MDF1_CLKSOURCE_MSIK:        /* MDF1 Clock is MSIK */
      MDF1_frequency = __LL_RCC_CALC_MSIK_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                               ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                                LL_RCC_MSIK_GetRange() :
                                                LL_RCC_MSIK_GetRangeAfterStandby()));
      break;

    default:
      /* unreachable code */
      break;
  }

  return MDF1_frequency;
}

/**
  * @brief  Return DAC1 clock frequency
  * @param  DAC1Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1_CLKSOURCE
  * @retval DAC1 clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that LSI or LSE oscillator is not ready
  */
uint32_t LL_RCC_GetDAC1ClockFreq(uint32_t DAC1Source)
{
  uint32_t DAC1_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_DAC1_CLKSOURCE(DAC1Source));

  /* DAC1CLK clock frequency */
  switch (LL_RCC_GetDAC1ClockSource(DAC1Source))
  {
    case LL_RCC_DAC1_CLKSOURCE_LSI:         /* DAC1 Clock is LSI  */
      DAC1_frequency = LSI_VALUE;
      break;

    case LL_RCC_DAC1_CLKSOURCE_LSE:         /* DAC1 Clock is LSE  */
      DAC1_frequency = LSE_VALUE;
      break;

    default:
      /* unreachable code */
      break;
  }

  return DAC1_frequency;
}

/**
  * @brief  Return OCTOSPI clock frequency
  * @param  OCTOSPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE
  * @retval OCTOSPI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator MSIK or PLL is not ready
  */
uint32_t LL_RCC_GetOCTOSPIClockFreq(uint32_t OCTOSPIxSource)
{
  uint32_t octospi_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_OCTOSPI_CLKSOURCE(OCTOSPIxSource));

  /* OCTOSPI clock frequency */
  switch (LL_RCC_GetOCTOSPIClockSource(OCTOSPIxSource))
  {
    case LL_RCC_OCTOSPI_CLKSOURCE_SYSCLK:   /* OCTOSPI clock is SYSCLK */
      octospi_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_OCTOSPI_CLKSOURCE_MSIK:     /* MSIk clock used as OCTOSPI clock */
      if (LL_RCC_MSIK_IsReady() == 1U)
      {
        octospi_frequency = __LL_RCC_CALC_MSIK_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                                    ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                                     LL_RCC_MSIK_GetRange() :
                                                     LL_RCC_MSIK_GetRangeAfterStandby()));
      }
      break;

    case LL_RCC_OCTOSPI_CLKSOURCE_PLL1:      /* PLL1 clock used as OCTOSPI source */
      if (LL_RCC_PLL1_IsReady() == 1U)
      {
        octospi_frequency = RCC_PLL1_GetFreqDomain_48M();
      }
      break;
    case LL_RCC_OCTOSPI_CLKSOURCE_PLL2:      /* PLL2 clock used as OCTOSPI source */
      if (LL_RCC_PLL2_IsReady() == 1U)
      {
        octospi_frequency = RCC_PLL2_GetFreqDomain_48M();
      }
      break;

    default:
      /* unreachable code */
      break;
  }

