RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_ll_rcc.c
    case LL_RCC_PLL1SOURCE_HSE:  /* HSE used as PLL1 clock source */
      pllinputfreq = HSE_VALUE;
      break;

    default:
      pllinputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                             ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                              LL_RCC_MSIS_GetRange() :
                                              LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }
  return __LL_RCC_CALC_PLL1CLK_FREQ(pllinputfreq, LL_RCC_PLL1_GetDivider(),
                                    LL_RCC_PLL1_GetN(), LL_RCC_PLL1_GetR());
}
/**
  * @brief  Return PLL1 clock frequency used for SAI domain
  * @retval PLL1 clock frequency (in Hz)
  */
static uint32_t RCC_PLL1_GetFreqDomain_SAI(void)
{
  uint32_t pll1inputfreq;
  uint32_t pll1outputfreq;
  uint32_t pll1source;
  uint32_t pll1n;
  uint32_t pll1pdiv;

  /* PLL_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE / PLLM) * PLLN
     SAI Domain clock = PLL_VCO / PLL1P
  */
  pll1source = LL_RCC_PLL1_GetMainSource();

  switch (pll1source)
  {
    case LL_RCC_PLL1SOURCE_MSIS:  /* MSI used as PLL1 clock source */
      pll1inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL1SOURCE_HSI:  /* HSI used as PLL1 clock source */
      pll1inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL1SOURCE_HSE:  /* HSE used as PLL1 clock source */
      pll1inputfreq = HSE_VALUE;
      break;

    default:
      pll1inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }

  pll1n = LL_RCC_PLL1_GetN();
  pll1pdiv = LL_RCC_PLL1_GetP();
  if ((pll1n >= 8U) && (pll1pdiv >= 2U))
  {
    pll1outputfreq = __LL_RCC_CALC_PLL1CLK_SAI_FREQ(pll1inputfreq, LL_RCC_PLL1_GetDivider(),
                                                    pll1n, pll1pdiv);
  }
  else
  {
    pll1outputfreq = 0;  /* Invalid PLL1N or PLL1PDIV value */
  }
  return pll1outputfreq;
}

/**
  * @brief  Return PLL clock frequency used for 48 MHz domain
  * @retval PLL clock frequency (in Hz)
  */
static uint32_t RCC_PLL1_GetFreqDomain_48M(void)
{
  uint32_t pll1inputfreq;
  uint32_t pll1source;

  /* PLL1_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL1M) * PLL1N
     48M Domain clock = PLL1_VCO / PLL1Q
  */
  pll1source = LL_RCC_PLL1_GetMainSource();

  switch (pll1source)
  {
    case LL_RCC_PLL1SOURCE_MSIS:  /* MSI used as PLL1 clock source */
      pll1inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL1SOURCE_HSI:  /* HSI used as PLL1 clock source */
      pll1inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL1SOURCE_HSE:  /* HSE used as PLL1 clock source */
      pll1inputfreq = HSE_VALUE;
      break;

    default:
      pll1inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }
  return __LL_RCC_CALC_PLL1CLK_48M_FREQ(pll1inputfreq, LL_RCC_PLL1_GetDivider(),
                                        LL_RCC_PLL1_GetN(), LL_RCC_PLL1_GetQ());
}

/**
  * @brief  Return PLL2 clock frequency used for SAI domain
  * @retval PLL2 clock frequency (in Hz)
  */
static uint32_t RCC_PLL2_GetFreqDomain_SAI(void)
{
  uint32_t pll2inputfreq;
  uint32_t pll2outputfreq;
  uint32_t pll2source;
  uint32_t pll2n;
  uint32_t pll2pdiv;

  /* PLL2_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL2M) * PLL2N */
  /* SAI Domain clock  = PLL2_VCO / PLL2P */
  pll2source = LL_RCC_PLL2_GetSource();

  switch (pll2source)
  {
    case LL_RCC_PLL2SOURCE_MSIS:  /* MSI used as PLLSAI1 clock source */
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL2SOURCE_HSI:  /* HSI used as PLL2 clock source */
      pll2inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL2SOURCE_HSE:  /* HSE used as PLL2 clock source */
      pll2inputfreq = HSE_VALUE;
      break;

    default:
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }

  pll2n = LL_RCC_PLL2_GetN();
  pll2pdiv = LL_RCC_PLL2_GetP();
  if ((pll2n >= 8U) && (pll2pdiv >= 2U))
  {
    pll2outputfreq = __LL_RCC_CALC_PLL2CLK_SAI_FREQ(pll2inputfreq, LL_RCC_PLL2_GetDivider(),
                                                    pll2n, pll2pdiv);
  }
  else
  {
    pll2outputfreq = 0;  /* Invalid PLL2N or PLL2PDIV value */
  }
  return pll2outputfreq;
}

/**
  * @brief  Return PLL2 clock frequency used for 48Mhz domain
  * @retval PLL2 clock frequency (in Hz)
  */
static uint32_t RCC_PLL2_GetFreqDomain_48M(void)
{
  uint32_t pll2inputfreq;
  uint32_t pll2source;

  /* PLLSAI1_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL2M) * PLL2N */
  /* 48M Domain clock  = PLL2_VCO / PLL2Q */
  pll2source = LL_RCC_PLL2_GetSource();

