RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_ll_rcc.c
  switch (pll2source)
  {
    case LL_RCC_PLL2SOURCE_MSIS:  /* MSI used as PLL2 clock source */
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL2SOURCE_HSI:  /* HSI used as PLL2 clock source */
      pll2inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL2SOURCE_HSE:  /* HSE used as PLL2 clock source */
      pll2inputfreq = HSE_VALUE;
      break;

    default:
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }
  return __LL_RCC_CALC_PLL2CLK_48M_FREQ(pll2inputfreq, LL_RCC_PLL2_GetDivider(),
                                        LL_RCC_PLL2_GetN(), LL_RCC_PLL2_GetQ());
}

/**
  * @brief  Return PLL2 clock frequency used for ADC domain
  * @retval PLL2 clock frequency (in Hz)
  */
static uint32_t RCC_PLL2_GetFreqDomain_ADC(void)
{
  uint32_t pll2inputfreq;
  uint32_t pll2source;

  /* PLL2_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL2M) * PLL2N */
  /* 48M Domain clock  = PLL2_VCO / PLL2R */
  pll2source = LL_RCC_PLL2_GetSource();

  switch (pll2source)
  {
    case LL_RCC_PLL2SOURCE_MSIS:  /* MSI used as PLL2 clock source */
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL2SOURCE_HSI:  /* HSI used as PLL2 clock source */
      pll2inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL2SOURCE_HSE:  /* HSE used as PLL2 clock source */
      pll2inputfreq = HSE_VALUE;
      break;

    default:
      pll2inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }
  return __LL_RCC_CALC_PLL2CLK_ADC_FREQ(pll2inputfreq, LL_RCC_PLL2_GetDivider(),
                                        LL_RCC_PLL2_GetN(), LL_RCC_PLL2_GetR());
}

/**
  * @brief  Return PLL3 clock frequency used for SAI domain
  * @retval PLL3 clock frequency (in Hz)
  */
static uint32_t RCC_PLL3_GetFreqDomain_SAI(void)
{
  uint32_t pll3inputfreq;
  uint32_t pll3outputfreq;
  uint32_t pll3source;
  uint32_t pll3n;
  uint32_t pll3pdiv;

  /* PLL3_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL3M) * PLL3N */
  /* SAI Domain clock  = PLL3_VCO / PLL3P */
  pll3source = LL_RCC_PLL3_GetSource();

  switch (pll3source)
  {
    case LL_RCC_PLL3SOURCE_MSIS:  /* MSI used as PLL3 clock source */
      pll3inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL3SOURCE_HSI:  /* HSI used as PLL3 clock source */
      pll3inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL3SOURCE_HSE:  /* HSE used as PLL3 clock source */
      pll3inputfreq = HSE_VALUE;
      break;

    default:
      pll3inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }

  pll3n = LL_RCC_PLL3_GetN();
  pll3pdiv = LL_RCC_PLL3_GetP();
  if ((pll3n >= 8U) && (pll3pdiv >= 2U))
  {
    pll3outputfreq = __LL_RCC_CALC_PLL3CLK_SAI_FREQ(pll3inputfreq, LL_RCC_PLL3_GetDivider(),
                                                    pll3n, pll3pdiv);
  }
  else
  {
    pll3outputfreq = 0;  /* Invalid PLL3N or PLL3PDIV value */
  }
  return pll3outputfreq;
}

/**
  * @}
  */

/**
  * @brief  Return PLL3clock frequency used for 48Mhz domain
  * @retval PLL3 clock frequency (in Hz)
  */
static uint32_t RCC_PLL3_GetFreqDomain_48M(void)
{
  uint32_t PLL3inputfreq;
  uint32_t PLL3source;

  /* PLLSAI1_VCO = (HSE_VALUE or HSI_VALUE or MSI_VALUE/ PLL3M) * PLL3N */
  /* 48M Domain clock  = PLL3_VCO / PLL3Q */
  PLL3source = LL_RCC_PLL3_GetSource();

  switch (PLL3source)
  {
    case LL_RCC_PLL3SOURCE_MSIS:  /* MSI used as PLL3 clock source */
      PLL3inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;

    case LL_RCC_PLL3SOURCE_HSI:  /* HSI used as PLL3 clock source */
      PLL3inputfreq = HSI_VALUE;
      break;

    case LL_RCC_PLL3SOURCE_HSE:  /* HSE used as PLL3 clock source */
      PLL3inputfreq = HSE_VALUE;
      break;

    default:
      PLL3inputfreq = __LL_RCC_CALC_MSIS_FREQ(LL_RCC_MSI_IsEnabledRangeSelect(),
                                              ((LL_RCC_MSI_IsEnabledRangeSelect() == 1U) ?
                                               LL_RCC_MSIS_GetRange() :
                                               LL_RCC_MSIS_GetRangeAfterStandby()));
      break;
  }
  return __LL_RCC_CALC_PLL3CLK_48M_FREQ(PLL3inputfreq, LL_RCC_PLL3_GetDivider(),
                                        LL_RCC_PLL3_GetN(), LL_RCC_PLL3_GetQ());
}

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */
